apps-cs/bad-mcxn-workspace.mcu/lcd/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW3_GPIO GPIO0               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW3_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW3_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW3_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW3_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW3_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT0_23 (coord B7), P0_23/SJ9[1]/SW2[3]/SW2[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW2_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW2_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW2_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);

#define PCR_IBE_ibe1 0x01u        /*!<@brief Input Buffer Enable: Enables */
#define PORT5_PCR_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT0_14 (coord E11), P0_14/J4[6]/SJ19[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P0_14_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P0_14_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P0_14_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P0_14_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P0_14_PIN 14U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P0_14_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT0_15 (coord G13), P0_15/SJ8[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P0_15_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P0_15_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P0_15_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P0_15_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P0_15_PIN 15U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P0_15_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT0_22 (coord B8), P0_22/J4[8]/SJ18[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P0_22_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P0_22_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P0_22_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P0_22_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P0_22_PIN 22U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P0_22_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT0_24 (coord B6), P0_24/SJ7[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P0_24_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P0_24_GPIO_PIN 24U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P0_24_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P0_24_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P0_24_PIN 24U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P0_24_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT0_25 (coord A6), P0_25/J2[12]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P0_25_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P0_25_GPIO_PIN 25U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P0_25_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P0_25_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P0_25_PIN 25U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P0_25_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT0_26 (coord F10), P0_26/J2[10]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P0_26_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P0_26_GPIO_PIN 26U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P0_26_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P0_26_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P0_26_PIN 26U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P0_26_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT0_28 (coord E8), P0_28/J2[2]
  @{ */

