apps-cs/bad-mcxn-workspace.mcu/lcd/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P0_28_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P0_28_GPIO_PIN 28U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P0_28_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P0_28_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P0_28_PIN 28U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P0_28_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT0_29 (coord F8), P0_29/J1[6]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P0_29_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P0_29_GPIO_PIN 29U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P0_29_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P0_29_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P0_29_PIN 29U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P0_29_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT0_30 (coord E7), P0_30/SJ2[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P0_30_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P0_30_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P0_30_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P0_30_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P0_30_PIN 30U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P0_30_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT0_31 (coord D7), P0_31/J1[16]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P0_31_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P0_31_GPIO_PIN 31U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P0_31_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P0_31_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P0_31_PIN 31U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P0_31_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT1_0 (coord C6), P1_0/J5[6]/J2[17]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P1_00_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P1_00_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P1_00_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P1_00_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P1_00_PIN 0U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P1_00_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT1_1 (coord C5), P1_1/J5[5]/J2[15]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P1_01_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P1_01_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P1_01_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P1_01_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P1_01_PIN 1U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P1_01_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT1_12 (coord D2), P1_12/J2[11]/J9[28]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P1_12_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P1_12_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P1_12_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P1_12_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P1_12_PIN 12U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P1_12_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT1_21 (coord L5), P1_21/SJ3[1]/J1[7]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P1_21_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P1_21_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P1_21_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P1_21_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P1_21_PIN 21U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P1_21_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT1_22 (coord L4), P1_22/J9[24]/J3[3]/SJ9[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P1_22_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P1_22_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P1_22_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P1_22_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P1_22_PIN 22U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P1_22_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT1_23 (coord M4), P1_23/J9[23]/SJ1[1]
  @{ */

