apps-cs/bad-mcxn-workspace.mcu/lcd/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P1_23_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P1_23_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P1_23_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P1_23_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P1_23_PIN 23U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P1_23_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT2_0 (coord H2), P2_0/J3[1]/SJ8[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P2_00_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P2_00_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P2_00_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P2_00_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P2_00_PIN 0U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P2_00_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT2_2 (coord H3), P2_2/TP5/J12[8]/J3[7]/SJ7[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P2_02_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P2_02_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P2_02_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P2_02_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P2_02_PIN 2U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P2_02_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT2_3 (coord J3), P2_3/TP4/J12[7]/J3[5]/SJ4[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P2_03_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P2_03_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P2_03_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P2_03_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P2_03_PIN 3U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P2_03_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT2_4 (coord K3), P2_4/TP26/J12[5]/J3[11]/SJ5[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P2_04_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P2_04_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P2_04_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P2_04_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P2_04_PIN 4U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P2_04_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT2_5 (coord K1), P2_5/TP25/J12[3]/J3[9]/SJ6[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P2_05_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P2_05_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P2_05_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P2_05_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P2_05_PIN 5U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P2_05_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT2_6 (coord K2), P2_6/TP24/J12[2]/J3[15]/SJ1[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P2_06_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P2_06_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P2_06_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P2_06_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P2_06_PIN 6U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P2_06_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT2_7 (coord L2), P2_7/TP23/J12[1]/J3[13]/SJ3[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P2_07_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P2_07_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P2_07_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P2_07_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P2_07_PIN 7U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P2_07_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT3_16 (coord J15), P3_16/SJ11[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P3_16_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P3_16_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P3_16_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P3_16_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P3_16_PIN 16U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P3_16_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT3_17 (coord K15), P3_17/J1[11]/SJ10[3]
  @{ */

