apps-cs/bad-mcxn-workspace.mcu/lcd/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P3_17_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P3_17_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P3_17_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P3_17_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P3_17_PIN 17U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P3_17_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT3_18 (coord K16), P3_18/J1[9]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P3_18_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P3_18_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P3_18_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P3_18_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P3_18_PIN 18U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P3_18_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT3_19 (coord K17), P3_19/J5[1]/J1[13]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P3_19_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P3_19_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P3_19_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P3_19_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P3_19_PIN 19U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P3_19_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT3_20 (coord M17), P3_20/J6[6]/J1[5]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P3_20_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P3_20_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P3_20_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P3_20_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P3_20_PIN 20U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P3_20_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT3_21 (coord L16), P3_21/J6[4]/J1[15]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P3_21_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P3_21_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P3_21_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P3_21_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P3_21_PIN 21U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P3_21_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT4_0 (coord P1), P4_0/J8[4]/SJ14[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P4_00_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P4_00_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P4_00_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P4_00_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P4_00_PIN 0U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P4_00_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT4_1 (coord P2), P4_1/J8[3]/SJ15[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P4_01_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P4_01_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P4_01_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P4_01_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P4_01_PIN 1U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P4_01_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT4_2 (coord T1), P4_2/J1[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P4_02_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P4_02_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P4_02_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P4_02_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P4_02_PIN 2U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P4_02_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT4_3 (coord U1), P4_3/J1[2]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P4_03_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P4_03_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P4_03_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P4_03_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P4_03_PIN 3U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P4_03_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT4_12 (coord T6), P4_12/SJ25[1]/J8[17]
  @{ */

