apps-cs/bad-mcxn-workspace.mcu/lcd/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P4_12_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P4_12_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P4_12_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P4_12_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P4_12_PIN 12U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P4_12_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT4_13 (coord T7), P4_13/SJ10[1]/SJ2[3]/J8[18]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P4_13_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P4_13_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P4_13_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P4_13_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P4_13_PIN 13U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P4_13_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT4_16 (coord R8), P4_16/SJ23[1]/J8[21]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P4_16_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P4_16_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P4_16_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P4_16_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P4_16_PIN 16U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P4_16_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT4_20 (coord T10), P4_20/SJ21[1]/J8[25]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P4_20_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P4_20_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P4_20_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P4_20_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P4_20_PIN 20U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P4_20_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORT5_2 (coord M10), P5_2/SJ19[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P5_02_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P5_02_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P5_02_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P5_02_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P5_02_PIN 2U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P5_02_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORT5_3 (coord N11), P5_3/SJ18[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define MCXN_KIT_P5_03_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define MCXN_KIT_P5_03_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define MCXN_KIT_P5_03_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MCXN_KIT_P5_03_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define MCXN_KIT_P5_03_PIN 3U                   /*!<@brief PORT pin number */
#define MCXN_KIT_P5_03_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MCXN_KIT_Pins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
